{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_ids": 0,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-Acceptable_Use",
    "2": "I-Acceptable_Use",
    "3": "B-Access_Control",
    "4": "I-Access_Control",
    "5": "B-Applicability",
    "6": "I-Applicability",
    "7": "B-Assistance_DPIA",
    "8": "I-Assistance_DPIA",
    "9": "B-Audit_Records",
    "10": "I-Audit_Records",
    "11": "B-Authority",
    "12": "I-Authority",
    "13": "B-BYOD_Endpoint_Security",
    "14": "I-BYOD_Endpoint_Security",
    "15": "B-Breach_Notification",
    "16": "I-Breach_Notification",
    "17": "B-Business_Item",
    "18": "I-Business_Item",
    "19": "B-Children_s_Data",
    "20": "I-Children_s_Data",
    "21": "B-Compliance_Filing",
    "22": "I-Compliance_Filing",
    "23": "B-Compliance_Regulatory",
    "24": "I-Compliance_Regulatory",
    "25": "B-Compliance_Termination",
    "26": "I-Compliance_Termination",
    "27": "B-Confidentiality",
    "28": "I-Confidentiality",
    "29": "B-Confidentiality_Non_Disclosure",
    "30": "I-Confidentiality_Non_Disclosure",
    "31": "B-Consent_Withdrawal",
    "32": "I-Consent_Withdrawal",
    "33": "B-Consideration_Payment",
    "34": "I-Consideration_Payment",
    "35": "B-Contracting_Requirements",
    "36": "I-Contracting_Requirements",
    "37": "B-Corporate_Governance",
    "38": "I-Corporate_Governance",
    "39": "B-Costs_Interest",
    "40": "I-Costs_Interest",
    "41": "B-Cross_Border_Transfers",
    "42": "I-Cross_Border_Transfers",
    "43": "B-Cross_Reference",
    "44": "I-Cross_Reference",
    "45": "B-Damages",
    "46": "I-Damages",
    "47": "B-Data_Processing_Purpose",
    "48": "I-Data_Processing_Purpose",
    "49": "B-Data_Security",
    "50": "I-Data_Security",
    "51": "B-Data_Subject_Rights",
    "52": "I-Data_Subject_Rights",
    "53": "B-Definitions",
    "54": "I-Definitions",
    "55": "B-Deletion_Return",
    "56": "I-Deletion_Return",
    "57": "B-Description_of_Property",
    "58": "I-Description_of_Property",
    "59": "B-Disciplinary_Action",
    "60": "I-Disciplinary_Action",
    "61": "B-Disclaimer_Warranty",
    "62": "I-Disclaimer_Warranty",
    "63": "B-Disclosure_Privacy_Requirements",
    "64": "I-Disclosure_Privacy_Requirements",
    "65": "B-Disclosure_Reporting",
    "66": "I-Disclosure_Reporting",
    "67": "B-Dispute_Resolution_Arbitration",
    "68": "I-Dispute_Resolution_Arbitration",
    "69": "B-Documentation",
    "70": "I-Documentation",
    "71": "B-Enforcement",
    "72": "I-Enforcement",
    "73": "B-Enforcement_Penalties",
    "74": "I-Enforcement_Penalties",
    "75": "B-Facts_Background",
    "76": "I-Facts_Background",
    "77": "B-Filing",
    "78": "I-Filing",
    "79": "B-Filing_Timelines",
    "80": "I-Filing_Timelines",
    "81": "B-Findings",
    "82": "I-Findings",
    "83": "B-Governance_Risk",
    "84": "I-Governance_Risk",
    "85": "B-Governing_Law",
    "86": "I-Governing_Law",
    "87": "B-Governing_Law_Jurisdiction",
    "88": "I-Governing_Law_Jurisdiction",
    "89": "B-Grant_of_Licence",
    "90": "I-Grant_of_Licence",
    "91": "B-Grievance_Redressal",
    "92": "I-Grievance_Redressal",
    "93": "B-Health_Safety",
    "94": "I-Health_Safety",
    "95": "B-Holding_Order",
    "96": "I-Holding_Order",
    "97": "B-IP_Ownership",
    "98": "I-IP_Ownership",
    "99": "B-Incident_Reporting",
    "100": "I-Incident_Reporting",
    "101": "B-Indemnity",
    "102": "I-Indemnity",
    "103": "B-Industrial_Relations",
    "104": "I-Industrial_Relations",
    "105": "B-Insider_Trading_Controls",
    "106": "I-Insider_Trading_Controls",
    "107": "B-Intellectual_Property",
    "108": "I-Intellectual_Property",
    "109": "B-Intermediary_Compliance",
    "110": "I-Intermediary_Compliance",
    "111": "B-International_Transfers",
    "112": "I-International_Transfers",
    "113": "B-Issues",
    "114": "I-Issues",
    "115": "B-Issues_for_Determination",
    "116": "I-Issues_for_Determination",
    "117": "B-Limitation_of_Liability",
    "118": "I-Limitation_of_Liability",
    "119": "B-Monitoring_Privacy",
    "120": "I-Monitoring_Privacy",
    "121": "B-Non_Compete_Non_Solicit",
    "122": "I-Non_Compete_Non_Solicit",
    "123": "B-Notices",
    "124": "I-Notices",
    "125": "B-Obligations",
    "126": "I-Obligations",
    "127": "B-Parties_Roles",
    "128": "I-Parties_Roles",
    "129": "B-Possession_Title",
    "130": "I-Possession_Title",
    "131": "B-Procedural_History",
    "132": "I-Procedural_History",
    "133": "B-Ratio_Decidendi",
    "134": "I-Ratio_Decidendi",
    "135": "B-Recordkeeping",
    "136": "I-Recordkeeping",
    "137": "B-Relief_Disposition",
    "138": "I-Relief_Disposition",
    "139": "B-Reporting_Incident",
    "140": "I-Reporting_Incident",
    "141": "B-Retention_Deletion",
    "142": "I-Retention_Deletion",
    "143": "B-Rights",
    "144": "I-Rights",
    "145": "B-Royalties_Payments",
    "146": "I-Royalties_Payments",
    "147": "B-Scope_Definitions",
    "148": "I-Scope_Definitions",
    "149": "B-Seat_Challenge",
    "150": "I-Seat_Challenge",
    "151": "B-Security_Measures",
    "152": "I-Security_Measures",
    "153": "B-Statutory_Interpretation",
    "154": "I-Statutory_Interpretation",
    "155": "B-Subprocessing",
    "156": "I-Subprocessing",
    "157": "B-Supervisory_Action",
    "158": "I-Supervisory_Action",
    "159": "B-Term_Termination",
    "160": "I-Term_Termination",
    "161": "B-Termination_Suspension",
    "162": "I-Termination_Suspension",
    "163": "B-Wages_Benefits",
    "164": "I-Wages_Benefits"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-Acceptable_Use": 1,
    "B-Access_Control": 3,
    "B-Applicability": 5,
    "B-Assistance_DPIA": 7,
    "B-Audit_Records": 9,
    "B-Authority": 11,
    "B-BYOD_Endpoint_Security": 13,
    "B-Breach_Notification": 15,
    "B-Business_Item": 17,
    "B-Children_s_Data": 19,
    "B-Compliance_Filing": 21,
    "B-Compliance_Regulatory": 23,
    "B-Compliance_Termination": 25,
    "B-Confidentiality": 27,
    "B-Confidentiality_Non_Disclosure": 29,
    "B-Consent_Withdrawal": 31,
    "B-Consideration_Payment": 33,
    "B-Contracting_Requirements": 35,
    "B-Corporate_Governance": 37,
    "B-Costs_Interest": 39,
    "B-Cross_Border_Transfers": 41,
    "B-Cross_Reference": 43,
    "B-Damages": 45,
    "B-Data_Processing_Purpose": 47,
    "B-Data_Security": 49,
    "B-Data_Subject_Rights": 51,
    "B-Definitions": 53,
    "B-Deletion_Return": 55,
    "B-Description_of_Property": 57,
    "B-Disciplinary_Action": 59,
    "B-Disclaimer_Warranty": 61,
    "B-Disclosure_Privacy_Requirements": 63,
    "B-Disclosure_Reporting": 65,
    "B-Dispute_Resolution_Arbitration": 67,
    "B-Documentation": 69,
    "B-Enforcement": 71,
    "B-Enforcement_Penalties": 73,
    "B-Facts_Background": 75,
    "B-Filing": 77,
    "B-Filing_Timelines": 79,
    "B-Findings": 81,
    "B-Governance_Risk": 83,
    "B-Governing_Law": 85,
    "B-Governing_Law_Jurisdiction": 87,
    "B-Grant_of_Licence": 89,
    "B-Grievance_Redressal": 91,
    "B-Health_Safety": 93,
    "B-Holding_Order": 95,
    "B-IP_Ownership": 97,
    "B-Incident_Reporting": 99,
    "B-Indemnity": 101,
    "B-Industrial_Relations": 103,
    "B-Insider_Trading_Controls": 105,
    "B-Intellectual_Property": 107,
    "B-Intermediary_Compliance": 109,
    "B-International_Transfers": 111,
    "B-Issues": 113,
    "B-Issues_for_Determination": 115,
    "B-Limitation_of_Liability": 117,
    "B-Monitoring_Privacy": 119,
    "B-Non_Compete_Non_Solicit": 121,
    "B-Notices": 123,
    "B-Obligations": 125,
    "B-Parties_Roles": 127,
    "B-Possession_Title": 129,
    "B-Procedural_History": 131,
    "B-Ratio_Decidendi": 133,
    "B-Recordkeeping": 135,
    "B-Relief_Disposition": 137,
    "B-Reporting_Incident": 139,
    "B-Retention_Deletion": 141,
    "B-Rights": 143,
    "B-Royalties_Payments": 145,
    "B-Scope_Definitions": 147,
    "B-Seat_Challenge": 149,
    "B-Security_Measures": 151,
    "B-Statutory_Interpretation": 153,
    "B-Subprocessing": 155,
    "B-Supervisory_Action": 157,
    "B-Term_Termination": 159,
    "B-Termination_Suspension": 161,
    "B-Wages_Benefits": 163,
    "I-Acceptable_Use": 2,
    "I-Access_Control": 4,
    "I-Applicability": 6,
    "I-Assistance_DPIA": 8,
    "I-Audit_Records": 10,
    "I-Authority": 12,
    "I-BYOD_Endpoint_Security": 14,
    "I-Breach_Notification": 16,
    "I-Business_Item": 18,
    "I-Children_s_Data": 20,
    "I-Compliance_Filing": 22,
    "I-Compliance_Regulatory": 24,
    "I-Compliance_Termination": 26,
    "I-Confidentiality": 28,
    "I-Confidentiality_Non_Disclosure": 30,
    "I-Consent_Withdrawal": 32,
    "I-Consideration_Payment": 34,
    "I-Contracting_Requirements": 36,
    "I-Corporate_Governance": 38,
    "I-Costs_Interest": 40,
    "I-Cross_Border_Transfers": 42,
    "I-Cross_Reference": 44,
    "I-Damages": 46,
    "I-Data_Processing_Purpose": 48,
    "I-Data_Security": 50,
    "I-Data_Subject_Rights": 52,
    "I-Definitions": 54,
    "I-Deletion_Return": 56,
    "I-Description_of_Property": 58,
    "I-Disciplinary_Action": 60,
    "I-Disclaimer_Warranty": 62,
    "I-Disclosure_Privacy_Requirements": 64,
    "I-Disclosure_Reporting": 66,
    "I-Dispute_Resolution_Arbitration": 68,
    "I-Documentation": 70,
    "I-Enforcement": 72,
    "I-Enforcement_Penalties": 74,
    "I-Facts_Background": 76,
    "I-Filing": 78,
    "I-Filing_Timelines": 80,
    "I-Findings": 82,
    "I-Governance_Risk": 84,
    "I-Governing_Law": 86,
    "I-Governing_Law_Jurisdiction": 88,
    "I-Grant_of_Licence": 90,
    "I-Grievance_Redressal": 92,
    "I-Health_Safety": 94,
    "I-Holding_Order": 96,
    "I-IP_Ownership": 98,
    "I-Incident_Reporting": 100,
    "I-Indemnity": 102,
    "I-Industrial_Relations": 104,
    "I-Insider_Trading_Controls": 106,
    "I-Intellectual_Property": 108,
    "I-Intermediary_Compliance": 110,
    "I-International_Transfers": 112,
    "I-Issues": 114,
    "I-Issues_for_Determination": 116,
    "I-Limitation_of_Liability": 118,
    "I-Monitoring_Privacy": 120,
    "I-Non_Compete_Non_Solicit": 122,
    "I-Notices": 124,
    "I-Obligations": 126,
    "I-Parties_Roles": 128,
    "I-Possession_Title": 130,
    "I-Procedural_History": 132,
    "I-Ratio_Decidendi": 134,
    "I-Recordkeeping": 136,
    "I-Relief_Disposition": 138,
    "I-Reporting_Incident": 140,
    "I-Retention_Deletion": 142,
    "I-Rights": 144,
    "I-Royalties_Payments": 146,
    "I-Scope_Definitions": 148,
    "I-Seat_Challenge": 150,
    "I-Security_Measures": 152,
    "I-Statutory_Interpretation": 154,
    "I-Subprocessing": 156,
    "I-Supervisory_Action": 158,
    "I-Term_Termination": 160,
    "I-Termination_Suspension": 162,
    "I-Wages_Benefits": 164,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.56.1",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 30522
}
